## Production: route53
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |             NAME              |
|--------|-------------------------------|
| add    | `aws_route53_zone.website_en` |
|        | `aws_route53_zone.website_fr` |
| delete | `aws_route53_zone.website`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_zone.website will be destroyed
  # (because aws_route53_zone.website is not in configuration)
  - resource "aws_route53_zone" "website" {
      - arn                 = "arn:aws:route53:::hostedzone/Z098140635TTC0ZAYCP4Y" -> null
      - comment             = "Managed by Terraform" -> null
      - force_destroy       = false -> null
      - id                  = "Z098140635TTC0ZAYCP4Y" -> null
      - name                = "design.cdssandbox.xyz" -> null
      - name_servers        = [
          - "ns-1093.awsdns-08.org",
          - "ns-1753.awsdns-27.co.uk",
          - "ns-30.awsdns-03.com",
          - "ns-677.awsdns-20.net",
        ] -> null
      - primary_name_server = "ns-30.awsdns-03.com" -> null
      - tags                = {
          - "CostCentre" = "gc-design-system-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all            = {
          - "CostCentre" = "gc-design-system-production"
          - "Terraform"  = "true"
        } -> null
      - zone_id             = "Z098140635TTC0ZAYCP4Y" -> null
    }

  # aws_route53_zone.website_en will be created
  + resource "aws_route53_zone" "website_en" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "design-system.cdssandbox.xyz"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.website_fr will be created
  + resource "aws_route53_zone" "website_fr" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "systeme-design.cdssandbox.xyz"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - hosted_zone_id            = "Z0187089115L834W3TQZN" -> null
  - hosted_zone_id_website    = "Z098140635TTC0ZAYCP4Y" -> null
  + hosted_zone_id_website_en = (known after apply)
  + hosted_zone_id_website_fr = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
